{
	"basics": {
		"name": "Matthew Vandenbossche",
		"label": "Software Engineer",
		"picture": "http://icodethin.gs/public/images/resume/me.jpg",
		"email": "matt@icodethin.gs",
		"phone": "+61 488 133 781",
		"website": "http://icodethin.gs",
		"summary": "I’m a self taught technology professional with over nine years of combined experience in software engineering and systems administration roles. Creator and contributor to multiple open source projects and advocate for open source ideology. I am hard-working, an abstract thinker, analytical, imaginative, original, and honest.",
		"profiles": [
			{
				"network": "Twitter",
				"username": "matt_v",
				"url": "https://twitter.com/matt_v"
			},
			{
				"network": "Github",
				"username": "icodethings",
				"url": "https://github.com/icodethings"
			}
		]
	},
	"work": [
		{
			"company": "ShopFrontPro (eCommerce Websites)",
			"position": "Software and System Engineer",
			"website": "http://shofrontpro.com",
			"startDate": "2012-08-01",
			"endDate": "2016-02-01",
			"summary": "Started off as a PHP developer, but quickly transitioned into both a Software and Systems Engineer. I designed and managed the custom fully scalable SaaS hosting infrastructure built on top of AWS while growing the ShopFrontPro platform.",
			"highlights": [
				"Built and managed a fully scalable, version controlled (GIT), custom SaaS hosting infrastructure in AWS",
				"Built and managed the AWS hosting infrastructure for Harvey Norman Group",
				"Designed and build a live WYSIWYG website editor",
				"Integrated with many 3rd party services",
				"Optimised existing PHP codebase for scale and 5x performance boost"
			]
		},
		{
			"company": "Freelance Software Engineer",
			"position": "",
			"startDate": "2007-07-01",
			"summary": "I work as a freelance web developer, developing and hosting sites for businesses and individuals, ranging from single static pages to complex apps with custom backends.",
		},
		{
			"company": "Craft By Code",
			"position": "Web Developer",
			"startDate": "2010-02-01",
			"endDate": "2011-02-01",
			"summary": "Worked with a team of two other talented web developers and designers in a small web development startup. My work with this team has helped me learn valuable team work and communication skills.",
		}
	],
	"skills": [
		{
			"name": "Software Engineer",
			"level": "Master",
			"keywords": [
				"HTML",
				"CSS",
				"Print Stylesheets",
				"Javascript",
				"PHP",
				"NodeJS",
				"React",
				"React Native",
				"Express.js"
			]
		},
		{
			"name": "System Engineer",
			"level": "Master",
			"keywords": [
				"AWS",
				"GIT",
				"Ubuntu Server",
				"NGINX",
				"PHP-FPM",
				"MySQL",
				"RethinkDB",
				"Redis"
			]
		}
	],
	"education": [
		{
			"institution": "RMIT",
			"area": "Computing Systems (Incomplete)",
			"studyType": "Bachelor",
			"startDate": "2012-01-01",
			"endDate": "2012-01-01"
		},
		{
			"institution": "Swinburne University of Technology",
			"area": "Programing (Website Development)  (Incomplete)",
			"studyType": "Certificate IV",
			"startDate": "2011-01-01",
			"endDate": "2011-01-01"
		},
		{
			"institution": "Wesley Collage",
			"area": "VCE",
			"studyType": "Completion",
			"startDate": "2005-01-01",
			"endDate": "2010-01-01",
			"courses": [
				"Drama Honor Colours 2010",
				"John Gibbs Award",
				"Certificate II in Creative Industries",
				"Certificate III in Media"
			]
		}
	],
	"languages": [
		{
			"language": "English",
			"fluency": "Native speaker"
		}
	],
	"references": [
		{
			"reference": "I'm really happy to write a recommendation for Matt - he's been an awesome teammate and developer and I believe he will make a positive impact wherever he ends up. Brandon came on board initially as a PHP developer but quickly moved into a dev ops role, moving ShopFrontPro forward with a SaaS hosting solution. He has helped with everything from developing new features, fixing bugs, and even doing email customer support. His dedication to the product has been real and very appreciated. I've personally benefited from Matt's attention to detail in researching new ways to write efficient code and his willingness to experiment with new technologies. Feel free to give me a call or email if you have any further questions. Consider this my glowing recommendation for Matt.",
			"name": "Adrian Mullan, Owner of ShopFrontPro"
		},
		{
			"reference": "Matt is an extremely talented engineer with a very broad range of skills and experience. From designing and maintaining a custom SaaS hosting environment, to designing and implementing countless 3rd party add ons and APIs, working with Matt has been fantastic. Matt is truly a full stack developer, and his work output is incredible. If there is any opportunity to work with Matt, I take it. He is the definition of an A player.",
			"name": "Aleksei Trofimachine, Senior Developer of ShopFrontPro"
		}
	]
}